# Introduction to Basic Python

In [1]:
#Importing libraries

#install pip in conda
#!conda install pip
import pandas as pd, numpy as np

## 1. Indentation
Python uses indentation for if-else statement, looping statement, so forth.
Other programming languages usually use bracket

In [2]:
#assign a number into variable
test = 80

#check the score
if test < 70:
    print('This student did not pass the course')
elif test > 70 :
    print('This student passed the course')

This student passed the course

# 2. Variables and types
On Python, we do not need to declare variables, just directly assign the data into a variable

In [3]:
#define an integer
weight = 65
print(weight)

#define a string - can use '' or "", it does not matter
staff_name = 'Christina'
print(staff_name)

#define a float
exam_score = 87.50
print(exam_score)

65
Christina
87.5

In [4]:
#define several variables simultaneously
seller, buyer = 'Adi', 'Agil'
print('%s has bought a bag from %s' % (buyer, seller)) ##

Agil has bought a bag from Adi

## Exercise

In [5]:
#define several variables
customer = 'Callum'
height = 178.394509
age = 39

#print the customer name, height and age in one line, 
#give 2 numbers after full stop on height variable
#format print: customer name is henny, height: 178.05 cm and age: 39

print ('customer name is %s , height : %.2f cm and age : %d' %  (customer, height, age)) 
#karakter khusus %s = string, %f = float dan %d = integer

customer name is Callum , height : 178.39 cm and age : 39

# 3. Lists
Python has many types of storing data. One of the popular ways to saving it is list

In [6]:
#create a list for 5 employees (same data type)
employees = ['Abigail', 'Bianca', 'Charlie', 
            'Dorothy', 'Erica']

print(employees[0])
print(len(employees)) ## mengethaui banyak data

Abigail
5

In [7]:
#add data into the existing list
employees.append('Mikhail')
print(employees)

['Abigail', 'Bianca', 'Charlie', 'Dorothy', 'Erica', 'Mikhail']

In [8]:
employees.extend (['Mikhail', 'Afi'])
print(employees)

['Abigail', 'Bianca', 'Charlie', 'Dorothy', 'Erica', 'Mikhail', 'Mikhail', 'Afi']

In [9]:
employees + ['Mikhail', 'Afi']
print(employees)

['Abigail', 'Bianca', 'Charlie', 'Dorothy', 'Erica', 'Mikhail', 'Mikhail', 'Afi']

In [10]:
#create a matrix, one array can be stored multiple data type
matrix = [['Abigail', 100059540, 30],
         ['Bianca', 12036564, 40],
         ['Charlie', 93465650, 45],
         ['Dorothy', 376170, 50],
         ['Erica', 7657120, 35]]

print(matrix[1])
print(matrix[2][2])
print(len(matrix))

['Bianca', 12036564, 40]
45
5

## Exercise

In [11]:
#create a matrix, one array can be stored multiple data type
#this matrix consist of customer name, salary and age
matrix = [['Brian', 100059540, 20],
         ['Dian', 12036564, 28],
         ['Kristin', 93465650, 25],
         ['Donny', 376170, 30],
         ['Andry', 7657120, 23],
         ['Stella', 3452343, 29]]

#print Andry's detail
print (matrix [4])

#print Stella's age
print (matrix [5][2])

['Andry', 7657120, 23]
29

In [12]:
#create a list of 6 customers
matrix = [['Brian', 100059540, 20],
         ['Dian', 12036564, 28],
         ['Kristin', 93465650, 25],
         ['Donny', 376170, 30],
         ['Andry', 7657120, 23],
         ['Stella', 3452343, 29]]

#print Andry from customer array 
print (matrix [4][0])

#print Donny from customer array
print (matrix [3][0])

Andry
Donny

# 4. Conditions
Python employs boolean variables to evaluate the given conditions.

In [13]:
shoes = 250000
if shoes < 500000 and shoes > 100000:
    print('Shoes price is between 100.000 and 500.000')

Shoes price is between 100.000 and 500.000

## Exercise

In [14]:
#create a program that groups a student into type of education level with these rules
#elementary: age from 6 - 12
#junior_hs: age from 12 - 15
#high_school: age from 15 - 18
#university: age from 18 - 22

ano = 19

#put your code here

if ano <12 and ano >6 :
    print('elementary')
elif ano <15 and ano >12:
    print('junior_hs')
elif ano <18 and ano >15:
    print('high_school')
elif ano <22 and ano>18 :            
    print('university')

university

# 5. Looping
Python has function to loop iterate over a given sequence with 'for' and 'while'

In [15]:
#create a list with 5 staffs
staffs = ['Adi', 'Agil', 'Henny', 'Ano', 'Hengky']

#print all the staff
for index, staff in enumerate(staffs):
    print('Staff %d : %s' % (index+1, staff))

Staff 1 : Adi
Staff 2 : Agil
Staff 3 : Henny
Staff 4 : Ano
Staff 5 : Hengky

## Exercise

In [16]:
#add one variable
staffs = ['Adi', 'Agil', 'Henny', 'Ano', 'Hengky']
debts = [5430340.405, 30345.034, 93445.344, 245454.453, 842555.533]

#print the staff name from staffs variable and with their debts (with 2 numbers after full stop)
#example staff 1 : Adi has debt 5430340.40
for index, debt in enumerate(debts):
    print('Staff %d : %s has debt %.2f' % (index+1, staffs[index], debt))

Staff 1 : Adi has debt 5430340.41
Staff 2 : Agil has debt 30345.03
Staff 3 : Henny has debt 93445.34
Staff 4 : Ano has debt 245454.45
Staff 5 : Hengky has debt 842555.53

# 6. Function
Instead of write the same code many times.
Code is used several times, can be created into function.

In [17]:
#define a function that calculates total salary
def print_total_salary(employee_number, salary):
    total = employee_number * salary
    print(total)

print_total_salary(10, 4000000)

40000000

In [18]:
#define a function that calculates total salary
def calculate_total_salary(employee_number, salary):
    total = employee_number * salary
    return total

#with return, we can store the result into a variable
#therefore, we can recall it 
total_salary = calculate_total_salary(10, 4000000)
total_expense = total_salary + (0.2 * total_salary)
print(total_expense)

48000000.0

## Exercise

In [19]:
#create a function that calculate total price
#food = 60000, drink = 20000, ppn = 10%, service charge = 5%
#store the result into a variable
#print the result

#define a function that calculates total price
def calculate_total_price(food, drink):
    total = food + drink
    return (total)

total_price = calculate_total_price(60000, 20000)
result = total_price + (0.1 * total_price) + (0.05 * total_price)
print(result)

92000.0

# 7. Pandas

In [20]:
#import the library
import pandas as pd

'''
The previous matrix
matrix = [['Brian', 100059540, 20],
         ['Dian', 12036564, 10],
         ['Kristin', 93465650, 15],
         ['Donny', 376170, 10],
         ['Andry', 7657120, 25],
         ['Stella', 3452343, 34]]
'''

#create dataframe from array with the labels
df = pd.DataFrame.from_records(matrix, columns=['staff', 'debt', 'age']) # load dr csv, matrik, library
df

     staff       debt  age
0    Brian  100059540   20
1     Dian   12036564   28
2  Kristin   93465650   25
3    Donny     376170   30
4    Andry    7657120   23
5   Stella    3452343   29

In [21]:
#print one of the column - series 
df['staff'] # kurung satu, mengeluarkan series

0      Brian
1       Dian
2    Kristin
3      Donny
4      Andry
5     Stella
Name: staff, dtype: object

In [22]:
#print several columns - dataframe
df[['staff', 'age']]

     staff  age
0    Brian   20
1     Dian   28
2  Kristin   25
3    Donny   30
4    Andry   23
5   Stella   29

In [23]:
#add some variables
cities = ['Jakarta', 'Bandung', 'Jakarta', 'Bali', 'Semarang', 'Jakarta']
years = [2010, 2009, 1992, 2014, 2000, 2005]

#add the variables into existing dataframe
df['city'] = pd.Series(cities)
df['year'] = pd.Series(years)

df

     staff       debt  age      city  year
0    Brian  100059540   20   Jakarta  2010
1     Dian   12036564   28   Bandung  2009
2  Kristin   93465650   25   Jakarta  1992
3    Donny     376170   30      Bali  2014
4    Andry    7657120   23  Semarang  2000
5   Stella    3452343   29   Jakarta  2005

In [24]:
#add new column by manipulating two existing columns
df['age_year'] = df['age'] + df['year']
df

     staff       debt  age      city  year  age_year
0    Brian  100059540   20   Jakarta  2010      2030
1     Dian   12036564   28   Bandung  2009      2037
2  Kristin   93465650   25   Jakarta  1992      2017
3    Donny     376170   30      Bali  2014      2044
4    Andry    7657120   23  Semarang  2000      2023
5   Stella    3452343   29   Jakarta  2005      2034

In [25]:
#delete the age_year column, inplace for delete permanently
df.drop('age_year', axis = 1, inplace = True) # axis = 1 itu kolom, 2 itu baris
df

     staff       debt  age      city  year
0    Brian  100059540   20   Jakarta  2010
1     Dian   12036564   28   Bandung  2009
2  Kristin   93465650   25   Jakarta  1992
3    Donny     376170   30      Bali  2014
4    Andry    7657120   23  Semarang  2000
5   Stella    3452343   29   Jakarta  2005

In [26]:
#delete the third row (Dorothy)
df.drop(3, axis = 0, inplace = True)

In [27]:
#query data 
df.loc[(df['year'] >= 2009) & (df['year'] <= 2010)]

   staff       debt  age     city  year
0  Brian  100059540   20  Jakarta  2010
1   Dian   12036564   28  Bandung  2009

In [28]:
#group by
df.groupby('city').mean()['age']

city
Bandung     28.000000
Jakarta     24.666667
Semarang    23.000000
Name: age, dtype: float64

In [29]:
#find the unique values
df['city'].unique()

array(['Jakarta', 'Bandung', 'Semarang'], dtype=object)

## Exercise

In [34]:
#add salaries variable into to the existing dataframe
# the new column named salary

salary = [335434050, 345349534, 69565444, 50358545, 69565444, 345349534]

#add the variables into existing dataframe
df['salary'] = pd.Series(salary)

df

     staff       debt  age      city  year     salary
0    Brian  100059540   20   Jakarta  2010  335434050
1     Dian   12036564   28   Bandung  2009  345349534
2  Kristin   93465650   25   Jakarta  1992   69565444
4    Andry    7657120   23  Semarang  2000   69565444
5   Stella    3452343   29   Jakarta  2005  345349534

In [36]:
#create new column named total_salary 
#calculates total_salary by multiplying age * salary
df['total_salary'] = df['age'] * df['salary']
df

     staff       debt  age      city  year     salary  total_salary
0    Brian  100059540   20   Jakarta  2010  335434050    6708681000
1     Dian   12036564   28   Bandung  2009  345349534    9669786952
2  Kristin   93465650   25   Jakarta  1992   69565444    1739136100
4    Andry    7657120   23  Semarang  2000   69565444    1600005212
5   Stella    3452343   29   Jakarta  2005  345349534   10015136486

In [38]:
#show only staff, age and total_salary for all staff
df[['staff','age', 'total_salary']]

     staff  age  total_salary
0    Brian   20    6708681000
1     Dian   28    9669786952
2  Kristin   25    1739136100
4    Andry   23    1600005212
5   Stella   29   10015136486

In [41]:
#select staff who is located in jakarta and year between 1990 and 2019
#query data 
df.loc[(df['year'] >= 1990) & (df['year'] <= 2019) & (df['city'] <= 'Jakarta') ]

     staff       debt  age     city  year     salary  total_salary
0    Brian  100059540   20  Jakarta  2010  335434050    6708681000
1     Dian   12036564   28  Bandung  2009  345349534    9669786952
2  Kristin   93465650   25  Jakarta  1992   69565444    1739136100
5   Stella    3452343   29  Jakarta  2005  345349534   10015136486